Revit 2026 API

# IFCFileCreateHeaderInstance Method

---

Creates an IFC header instance in the file model.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAnyHandle CreateHeaderInstance(
	string name
)
```
```vb
Public Function CreateHeaderInstance (
	name As String
) As IFCAnyHandle
```
```cpp
public:
IFCAnyHandle^ CreateHeaderInstance(
	String^ name
)
```
```fsharp
member CreateHeaderInstance :
        name : string -> IFCAnyHandle
```

#### Parameters

name String
     The instance name.

#### Return Value

IFCAnyHandle The instance handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

file_schema, file_description and file_name must be created to get IFC file written successfully. Otherwise, the output IFC file would be empty.

#### Reference

IFCFile Class

Autodesk.Revit.DB.IFC Namespace